In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import statistics

%matplotlib inline

In [3]:
my_data = pd.DataFrame(
    {
        'type': ['A', 'A', 'B', 'B'],
        'value': [10, 14, 12, 23]
        
    }
)

In [4]:
my_data.head()

  type  value
0    A     10
1    A     14
2    B     12
3    B     23

In [122]:
my_stat = pd.read_csv('https://stepik.org/media/attachments/course/4852/my_stat.csv')

In [7]:
my_stat.head()

   V1    V2 V3   V4
0   2  13.0  B  1.0
1  -1   7.0  B  1.0
2   0  11.0  A  0.0
3   2  11.0  A  2.0
4   0  10.0  B -1.0

In [64]:
subset_1 = my_stat[['V1','V3']].iloc[:10,:]

In [65]:
subset_2 = my_stat[['V2','V4']].drop([0,5])

In [68]:
subset_1 = my_stat[(my_stat.V1 > 0) & (my_stat.V3 == 'A') ]

In [70]:
subset_2 = my_stat[(my_stat.V2 != 10) | (my_stat.V4 >= 1) ]

In [71]:
subset_1.head()

    V1    V2 V3   V4
3    2  11.0  A  2.0
5    2  11.0  A  0.0
7    1   9.0  A  1.0
10   1  10.0  A  1.0
13   1  12.0  A  3.0

In [72]:
subset_2.head()

   V1    V2 V3   V4
0   2  13.0  B  1.0
1  -1   7.0  B  1.0
2   0  11.0  A  0.0
3   2  11.0  A  2.0
5   2  11.0  A  0.0

In [76]:
my_stat['V5'] = my_stat.V1 + my_stat.V4
my_stat['V6'] = np.log(my_stat.V2)

In [75]:
my_stat.head()

   V1    V2 V3   V4   V5        V6
0   2  13.0  B  1.0  3.0  0.000000
1  -1   7.0  B  1.0  0.0  0.000000
2   0  11.0  A  0.0  0.0      -inf
3   2  11.0  A  2.0  4.0  0.693147
4   0  10.0  B -1.0 -1.0       NaN

In [123]:
my_stat.rename(columns=
    {'V1': 'session_value',
     'V2': 'group',
     'V3': 'time',
     'V4': 'n_users'
    },
               inplace=True
)

In [124]:
my_stat.session_value.fillna(0, inplace=True)

In [125]:
n_users_median = my_stat[my_stat.n_users >= 0].n_users.median()

In [126]:
my_stat.loc[my_stat.n_users < 0, 'n_users'] = n_users_median

In [128]:
my_stat.head()

   session_value  group time  n_users
0              2   13.0    B      1.0
1             -1    7.0    B      1.0
2              0   11.0    A      0.0
3              2   11.0    A      2.0
4              0   10.0    B      1.0

In [132]:
mean_session_value_data = (
    my_stat.groupby('group', as_index=False)
    .agg({'session_value': 'mean'})
    .rename(columns={
        'session_value': 'mean_session_value'})
    )

In [133]:
mean_session_value_data.head()

   group  mean_session_value
0    5.0            0.000000
1    7.0            0.333333
2    8.0            0.633333
3    9.0            0.238938
4   10.0            0.065990